
** Basic UI

#+begin_src emacs-lisp
(setq mac-command-modifier 'meta ;; I want this to do nothing.
      mac-option-modifier 'meta)

;;; Code:
(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)
(electric-indent-mode -1)
(set-fringe-mode 10)  ;; size of margins in pixels


;; Always make tabs into spaces
(setq-default indent-tabs-mode nil)

(set-frame-font "Menlo 24")

(use-package command-log-mode
)

;; Without this, doom-modeline will display chinese characters, which
;; I cannot read.
;; You also need to run M-x all-the-icons-install-fonts 
;; and nerd-icons-install-fonts
(use-package all-the-icons
  :if (display-graphic-p))

   (use-package all-the-icons-dired
     :hook (dired-mode . all-the-icons-dired-mode))

(use-package doom-modeline
  :init (doom-modeline-mode 1)
  :custom
  (doom-modeline-height 15)
  ;;  why does this not set at startup?
)


   (use-package beacon
     :config (beacon-mode 1))

;;  Appearance
(defun transparency (value)
  "Set the transparency of the frame window.
VALUE from 0 = transparent, 100 = opaque"
  (interactive "nTransparency Value 0 - 100 opaque:")
  (set-frame-parameter (selected-frame) 'alpha value))

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode)
  )
#+end_src

#+begin_src emacs-lisp


#+end_src

#+RESULTS:
| doom-1337 | doom-Iosvkem | doom-acario-dark | doom-acario-light | doom-ayu-dark | doom-ayu-light | doom-ayu-mirage | doom-badger | doom-bluloco-dark | doom-bluloco-light | doom-challenger-deep | doom-city-lights | doom-dark+ | doom-dracula | doom-earl-grey | doom-ephemeral | doom-fairy-floss | doom-feather-dark | doom-feather-light | doom-flatwhite | doom-gruvbox-light | doom-gruvbox | doom-henna | doom-homage-black | doom-homage-white | doom-horizon | doom-ir-black | doom-lantern | doom-laserwave | doom-manegarm | doom-material-dark | doom-material | doom-meltbus | doom-miramare | doom-molokai | doom-monokai-classic | doom-monokai-machine | doom-monokai-octagon | doom-monokai-pro | doom-monokai-ristretto | doom-monokai-spectrum | doom-moonlight | doom-nord-aurora | doom-nord-light | doom-nord | doom-nova | doom-oceanic-next | doom-oksolar-dark | doom-oksolar-light | doom-old-hope | doom-one-light | doom-one | doom-opera-light | doom-opera | doom-outrun-electric | doom-palenight | doom-peacock | doom-pine | doom-plain-dark | doom-plain | doom-rouge | doom-shades-of-purple | doom-snazzy | doom-solarized-dark-high-contrast | doom-solarized-dark | doom-solarized-light | doom-sourcerer | doom-spacegrey | doom-tokyo-night | doom-tomorrow-day | doom-tomorrow-night | doom-vibrant | doom-wilmersdorf | doom-winter-is-coming-dark-blue | doom-winter-is-coming-light | doom-xcode | doom-zenburn |

** Org-mode

#+begin_src emacs-lisp
  (require 'ox-md nil t)

  (setq org-hide-emphasis-markers t)

  (add-hook 'org-mode-hook 'org-indent-mode)
  ;; (add-hook 'org-mode-hook 'variable-pitch-mode)
  (add-hook 'org-mode-hook 'visual-line-mode)

  ;; Don't add new lines
  (setf org-blank-before-new-entry '((heading . nil) (plain-list-item . nil)))

  ;; subscripts/superscripts 
  ;; https://orgmode.org/manual/Subscripts-and-Superscripts.html#Subscripts-and-Superscripts
  (setq org-pretty-entities t)
  (setq org-pretty-entities-include-sub-superscripts t)

  ;; kanban
  (use-package org-kanban
    :straight t
    :config 
    (setq
     org-kanban/layout '("..." . 24)
     org-kanban/next-keys "tf"
     org-kanban/prev-keys "tb"
    )
  )

(use-package toc-org
  :straight t
  :after org
  :init (add-hook 'org-mode-hook #'toc-org-enable)
)

(use-package org-modern
  :straight t
  :hook
  (org-mode . org-modern-mode)
  (org-agenda-mode . org-modern-agenda)
  :config
  (setq org-modern-star '("◉" "○" "✸" "✿" "✤" "✜" "◆" "▶")
        org-modern-table-vertical 1
        org-modern-table-horizontal 0.2
        org-modern-list '((43 . "➤") (45 . "–") (42 . "•"))))
#+end_src

#+RESULTS:
| org-modern-agenda |

You can put =# -*- org-confirm-babel-evaluate: nil -*-=
at the top of a document to avoid typing =yes= to 20+ src blocks.


You can also use
#+begin_src emacs-lisp
(setq org-confirm-babel-evaluate nil)
#+end_src


** Python


#+begin_src emacs-lisp

  (use-package lsp-mode
    :straight t
    :commands lsp
    :config
    (setq lsp-disabled-clients nil)
    (setq lsp-enabled-clients '(pyright ruff-lsp))
    (setq lsp-diagnostics-provider :flycheck)
    :hook
    (python-mode . lsp))

   (use-package lsp-pyright
     :ensure t
     :hook (python-mode . (lambda ()
                           (require 'lsp-pyright)
                           (lsp))))

  (with-eval-after-load 'lsp-mode
    (add-to-list 'lsp-language-id-configuration
                 '(python-mode . "python"))
    (lsp-register-client
     (make-lsp-client
      :new-connection (lsp-stdio-connection "ruff-lsp")
      :activation-fn (lsp-activate-on "python")
      :priority -1
      :server-id 'ruff-lsp)))

  (use-package lsp-ui
    :straight t
    :commands lsp-ui-mode
    :config
    (setq lsp-ui-doc-enable t)
    (setq lsp-ui-sideline-show-diagnostics t)
    (setq lsp-ui-doc-position 'at-point)
  )


  (use-package pyvenv
    :straight t
    :init
    (setenv "WORKON_HOME" "~/venvs/")
    :config
    (pyvenv-mode t)

    ;; you want M-x pyvenv-activate RET dir_to_the_environment/env
    ;; and then `C-c C-p`

    ;; Set correct Python interpreter
    (setq pyvenv-post-activate-hooks
          (list (lambda ()
                  (setq python-shell-interpreter (concat pyvenv-virtual-env "bin/python3")))))
    (setq pyvenv-post-deactivate-hooks
          (list (lambda ()
                  (setq python-shell-interpreter "python3")))))


  (defun my_set_venv (venv)
    "Tell flycheck to use pylint, flake8, etc.. from a VENV."
    (interactive "sChoose a venv from ~/venvs/")
    ;; (setq-local pylintexec (concat "/Users/patrickfoley/venvs/" venv "/bin/pylint"))
    (message "Setting pylint & flake8 for flycheck to use %s " venv)
    (setq flycheck-python-pylint-executable
          (concat "/Users/patrickfoley/venvs/" venv "/bin/pylint")
          )
    (setq flycheck-python-flake8-executable
          (concat "/Users/patrickfoley/venvs/" venv "/bin/flake83")
          )
    (setq flycheck-python-flake8-executable
          (concat "/Users/patrickfoley/venvs/" venv "/bin/flake82")
          )
    (message "Setting lsp-pyright-python-executable-cmd  %s " venv)
    (setq lsp-pyright-python-executable-cmd
          (concat "/Users/patrickfoley/venvs/" venv "/bin/python")
          )
  )


  (use-package blacken
    :straight t
    :config
    ;;(add-hook 'python-mode-hook 'blacken-mode)
    )


  (use-package py-yapf
    :straight t
    )

  ;;  EIN - Emacs IPython Notebook
  ;;  Do not use the old repo maintained by tkf,
  ;;  check out the new one at https://github.com/millejoh/emacs-ipython-notebook
  ;;  For some reason, ein:jupyter-server-start does not work
  ;;  It all works fine if I open the notebook server in an eshell.
  ;; See https://github.com/millejoh/emacs-ipython-notebook/issues/176#issuecomment-299512815
  ;; for issues with being unable to log in.
  ;;  Ein Notes:
  ;;    run ein:notebooklist-login, use the password
  ;;    
  (use-package ein
    :straight t
    :commands (ein:notebooklist-open)
    :config
    (defvar ein:jupyter-default-server-command)
    (defvar ein:jupyter-server-args)
    (setq ein:jupyter-default-server-command "~/venvs/sf39/bin/jupyter"
  	ein:jupyter-server-args (list "--no-browser"))
    (setq ein:output-area-inlined-images t)
  )
#+end_src

#+RESULTS:
: t

Can I make the plots a bit smaller?

#+begin_src emacs-lisp
(defun my-ein-setup ()
  (setq ein:output-area-inlined-images t)
  (setq ein:slice-image t)
  (setq ein:slice-image-data '(800 . nil)))  ; Width in pixels

(add-hook 'ein:notebook-mode-hook 'my-ein-setup)
#+end_src

#+RESULTS:
| my-ein-setup |

*** GPTel

#+begin_src emacs-lisp
        (use-package gptel
          :straight t

          :bind (("C-c g" . gptel)
                 ("C-c G" . gptel-send))
          :config
          (setq gptel-default-mode 'org-mode)
      ;; https://github.com/karthink/gptel/issues/351
      ;; for the 
      ;; Claude error: (HTTP/2 400) messages.2: all ;;messages must have non-empty content except ;; for the optional final assistant message
      ;;issue 
      (defun my/gptel-font-lock-update (&rest _)
          (when (and font-lock-mode (derived-mode-p 'org-mode))
            (font-lock-update)))
      (add-hook 'gptel-post-response-functions #'my/gptel-font-lock-update)

          ;; local
          (load-file "~/.emacs.d/gptel-config.el")
          )

#+end_src

#+RESULTS:
| my/gptel-font-lock-update |

I am trying to be able to save/load contexts as files.

#+begin_src emacs-lisp
(org-babel-load-file "~/.emacs.d/gptel-context-persistence.org")
#+end_src

#+RESULTS:
: Loaded ~/.emacs.d/gptel-context-persistence.el


#+begin_src emacs-lisp
;; Add a keybinding for the context manager
;;(global-set-key (kbd "C-c g p t") 'gptel-context-manager)
#+end_src



